//=============================================================================
//
// ２Ｄポリゴン表示処理 [main.h]
// Author : AKIRA TANAKA
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
// ヘッダファイル
//*****************************************************************************
#include <Windows.h>
#include <d3dx9.h>	// d3d9.h もインクルードされる
#define DIRECTINPUT_VERSION  (0x0800)  //順番大事
#include <dinput.h>

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCREEN_WIDTH	(1280)					// ウインドウの幅
#define SCREEN_HEIGHT	(720)					// ウインドウの高さ
#define SCREEN_CENTER_X	(SCREEN_WIDTH / 2)		// ウインドウの中心Ｘ座標
#define SCREEN_CENTER_Y	(SCREEN_HEIGHT / 2)		// ウインドウの中心Ｙ座標

//*****************************************************************************
// ライブラリファイル
// [構成プロパティ]->[リンカー]->[入力]->[追加の依存ファイル]に記述しても可能
//*****************************************************************************
#pragma comment (lib, "d3d9.lib")
#pragma comment (lib, "d3dx9.lib")
#pragma comment (lib, "dxguid.lib")
#pragma comment (lib, "winmm.lib")
#pragma comment(lib,"dinput8.lib")		//ダイレクトインプット

//前方宣言
//class CRenderer;
//class CScene;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
//CRenderer *GetRenderer(void);
//CScene *GetScene(void);
int GetFPS(void);

#endif